Tekla Open API Reference for Tekla Structures 2025
ProfileConversion Class
 The ProfileConversion class provides functionalities to convert profile strings from/to current units (set in "Units and decimals, Catalog, Profiles, Section Dimension" options).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.ProfileConversion
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ProfileConversion
Public Class ProfileConversion
The ProfileConversion type exposes the following members.
Constructors
Name | Description
ProfileConversion
Initializes a new instance of the ProfileConversion class
Top
Methods
Name | Description
ConvertFromCurrentUnits
 Converts a profile string from current units to internal units (set in Units and decimals options).
ConvertToCurrentUnits
 Converts a profile string from internal units to current units (set in Units and decimals options).
Top
Examples
 The next example assumes that the option "Units and decimals, Catalog, Profiles, Section Dimension" is set to "in".
using Tekla.Structures.Dialog;
class Example
{
    public Example()
    {
        string Profile = "PL10*10"; // Or "PL10\"*10\""
        string ConvertedProfile = string.Empty;
        ProfileConversion.ConvertFromCurrentUnits(Profile, ref ConvertedProfile);
        // ConvertedProfile will contain "PL254*254"
        Profile = "PL508*25.4";
        ProfileConversion.ConvertToCurrentUnits(Profile, ref ConvertedProfile);
        // The converted profile will contain "PL20\"*1\""
    }
}
See Also
Reference
Tekla.Structures.Dialog Namespace